api/app/controllers/recipes_controller.rb

	def index
		@recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

	def create
		@recipe = Recipe.create(
          title: params["title"],
          url: params["url"],
          food_image_url: params["food_image_url"],
          material: params["material"],
      	  cost: params["cost"],
          indication: params["indication"]
      )
---
INSERT INTO `recipes` (`title`, `url`, `food_image_url`, `material`, `cost`, `indication`, `created_at`, `updated_at`) VALUES ('aefdsf', NULL, NULL, NULL, NULL, NULL, '2022-11-09 09:13:59.457750', '2022-11-09 09:13:59.457750')